#include <stdio.h>
#include <math.h>

int main() {
    int x1, y1, r1, x2, y2, r2; // координати центрів та радіуси двох кіл
    scanf("%d %d %d %d %d %d", &x1, &y1, &r1, &x2, &y2, &r2);
    double d = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1)); // обчислення відстані між центрами кіл
    if (d == 0 && r1 == r2) { // перевірка умови співпадання кіл
        printf("-1\n");
    } else if (d > r1 + r2 || d < fabs(r1 - r2)) { // перевірка умови відсутності точок перетину
        printf("0\n");
    } else if (d == r1 + r2 || d == fabs(r1 - r2)) { // перевірка умови наявності однієї точки перетину
        printf("1\n");
    } else { // інакше є дві точки перетину
        printf("2\n");
    }
    return 0;
}
